99Cats-part2/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "session_token", "updated_at", "user_name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @user = User.find(params[:id])