AwesomeReddit/app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "parent_comment_id", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "please work"], ["created_at", "2015-01-21 20:05:48.110076"], ["parent_comment_id", 4], ["post_id", 9], ["updated_at", "2015-01-21 20:05:48.110076"], ["user_id", 1]]

  def show
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 3]]