AwesomeReddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "    asdf"], ["created_at", "2015-01-05 00:20:19.838864"], ["title", "asdf"], ["updated_at", "2015-01-05 00:20:19.838864"], ["url", ""], ["user_id", 1]]
---
  def create
    @post = current_user.posts.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2, "url" = $3 WHERE "posts"."id" = 3  [["content", "Lakers looking up now that Kobe distributing    \r\n    \r\n    "], ["updated_at", "2015-01-04 22:21:17.391818"], ["url", "lakers.com"]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)