AwesomeReddit/app/views/posts/show_post.html.erb

This post is on these subs:
<% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 5]]

<br>
<% @post.parent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 4]]