RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("author_id", "content", "created_at", "sub_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_sub_posts.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "posts"."id" = 6  [["content", "I don't know time    \r\n    "], ["title", "What"], ["updated_at", "2014-11-01 00:35:49.655633"]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)