RedditClone/app/controllers/subs_controller.rb

  def index
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @sub = current_user.subs.new(sub_params)

    #id not assigned until save
    if @sub.save
---
INSERT INTO "subs" ("created_at", "description", "moderator_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-10-31 22:16:44.768010"], ["description", "This is a sub about not Lebron things    "], ["moderator_id", 6], ["title", "NBA"], ["updated_at", "2014-10-31 22:16:44.768010"]]

  def show
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs"  WHERE "subs"."id" = $1 LIMIT 1  [["id", 9]]
UPDATE "subs" SET "description" = $1, "title" = $2, "updated_at" = $3 WHERE "subs"."id" = 7  [["description", "Plays the banjo    \r\n    "], ["title", "Bluegrass"], ["updated_at", "2014-10-31 22:55:37.329778"]]